{"id": "gdpr_article_13_14_0", "text": "GDPR Articles 13 and 14 - Information to be provided to data subjects.\nControllers must provide data subjects with concise, transparent, intelligible and easily accessible information about processing. This includes identity of the controller, purposes of processing, legal basis, recipients, transfers to third countries, data retention period, rights of access, rectification, erasure, restriction, objection and portability, and the right to lodge a complaint.\nWhere personal data was not obtained from the data subject, similar information must be provided within a reasonable period.", "article": "Article 13 14", "topic": "article-13-14", "source": "data/regulations/gdpr/source/gdpr_article_13_14.txt"}
{"id": "gdpr_article_28_0", "text": "GDPR Article 28 - Processor.\nWhere processing is carried out on behalf of a controller, the controller shall use only processors providing sufficient guarantees to implement appropriate technical and organizational measures. Processing by a processor shall be governed by a contract that sets out subject matter and duration, nature and purpose, type of personal data and categories of data subjects, and obligations and rights of the controller.\nThe processor shall process personal data only on documented instructions from the controller, ensure confidentiality, take security measures, assist with data subject requests, support compliance obligations, delete or return data at end of services, a", "article": "Article 28", "topic": "article-28", "source": "data/regulations/gdpr/source/gdpr_article_28.txt"}
{"id": "gdpr_article_28_1", "text": "measures, assist with data subject requests, support compliance obligations, delete or return data at end of services, and allow audits and inspections.", "article": "Article 28", "topic": "article-28", "source": "data/regulations/gdpr/source/gdpr_article_28.txt"}
{"id": "gdpr_article_32_0", "text": "GDPR Article 32 - Security of processing.\nControllers and processors shall implement appropriate technical and organizational measures to ensure a level of security appropriate to risk. Measures may include pseudonymization and encryption of personal data, ability to ensure ongoing confidentiality, integrity, availability and resilience of processing systems and services, ability to restore availability and access in a timely manner after incident, and a process for regularly testing and evaluating effectiveness of security measures.", "article": "Article 32", "topic": "article-32", "source": "data/regulations/gdpr/source/gdpr_article_32.txt"}
{"id": "gdpr_article_33_0", "text": "GDPR Article 33 - Notification of a personal data breach to the supervisory authority.\nIn the case of a personal data breach, the controller shall without undue delay and, where feasible, not later than 72 hours after becoming aware of it, notify the supervisory authority unless the breach is unlikely to result in a risk to rights and freedoms of natural persons.\nWhere notification is not made within 72 hours, reasons for delay should be provided. Processors must notify the controller without undue delay after becoming aware of a breach.", "article": "Article 33", "topic": "article-33", "source": "data/regulations/gdpr/source/gdpr_article_33.txt"}
{"id": "gdpr_article_5_0", "text": "GDPR Article 5 - Principles relating to processing of personal data.\nPersonal data shall be processed lawfully, fairly and in a transparent manner. Data must be collected for specified, explicit and legitimate purposes and not further processed in a way that is incompatible with those purposes. Processing shall be adequate, relevant and limited to what is necessary. Data should be accurate and kept up to date. Personal data must be kept in a form permitting identification for no longer than necessary. Processing must ensure appropriate security, including protection against unauthorized or unlawful processing and against accidental loss, destruction or damage, using technical or organization", "article": "Article 5", "topic": "article-5", "source": "data/regulations/gdpr/source/gdpr_article_5.txt"}
{"id": "gdpr_article_5_1", "text": "unauthorized or unlawful processing and against accidental loss, destruction or damage, using technical or organizational measures.", "article": "Article 5", "topic": "article-5", "source": "data/regulations/gdpr/source/gdpr_article_5.txt"}
{"id": "gdpr_article_6_0", "text": "GDPR Article 6 - Lawfulness of processing.\nProcessing is lawful only if at least one legal basis applies. These include consent, performance of a contract, compliance with a legal obligation, protection of vital interests, performance of a task carried out in the public interest or exercise of official authority, and legitimate interests pursued by the controller except where overridden by interests or rights of the data subject.\nControllers should document and communicate the legal basis used for each processing activity.", "article": "Article 6", "topic": "article-6", "source": "data/regulations/gdpr/source/gdpr_article_6.txt"}
